===
simple axiom
===

axm %core.whatever: Nat → Nat;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		type: (function_type
			(primitive_type)
			(primitive_type))))

===
simple axiom with comment
===

axm %core.whatever: Nat → Nat; // test

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		type: (function_type
			(primitive_type)
			(primitive_type)))
	(line_comment))

===
simple axiom with trailing space
===

axm %core.whatever: Nat → Nat;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		type: (function_type
			(primitive_type)
			(primitive_type))))

=====
axiom with subgroups
=====

axm %core.nat(add, sub, mul): «2; Nat» → Nat;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier))
		type: (function_type
			(array_type
				size: (int_literal)
				type: (primitive_type))
			(primitive_type))))

=====
axiom with aliases
=====

axm %test.foo(blub = b = blb, krams = k): Nat;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier)
			(value_identifier)
			subtag: (value_identifier)
			subtag: (value_identifier)
			(value_identifier)
			subtag: (value_identifier))
		type: (primitive_type)))

=====
axiom with normalizer
=====

axm %test.norm.alize: Nat, normalize;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier)
			subtag: (value_identifier))
		type: (primitive_type)
		normalizer: (value_identifier)))

=====
idx axiom
=====

axm %core.idx: [s: Nat] → [m: Nat] → [l: Nat] → Idx s, normalize_idx;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		type: (function_type
			(pattern (pattern (value_identifier) type: (primitive_type)))
			(function_type
				(pattern (pattern (value_identifier) type: (primitive_type)))
				(function_type
					(pattern (pattern (value_identifier) type: (primitive_type)))
					(primitive_type (value_identifier)))))
		normalizer: (value_identifier)))

=====
bit2 axiom
=====

axm %core.bit2( f,      nor, nciff, nfst, niff, nsnd, xor_, nand,
                and_,  nxor,   snd,  iff,  fst, ciff,  or_,    t):
    {s: Nat} → [m: Nat] → «2; Idx s» → Idx s , normalize_bit2;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier)
			(value_identifier))
		type: (function_type
			(pattern (pattern (value_identifier) type: (primitive_type)))
			(function_type
				(pattern (pattern (value_identifier) type: (primitive_type)))
				(function_type
					(array_type
						size: (int_literal)
						type: (primitive_type (value_identifier)))
					(primitive_type (value_identifier)))))
		normalizer: (value_identifier)))

=====
mat axiom
=====

axm %matrix.Mat: [n: Nat, S: «n; Nat», T: *] → *;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (type_identifier))
		type: (function_type
			(pattern
				(pattern (value_identifier) type: (primitive_type))
				(pattern (type_identifier)
					type: (array_type size: (value_identifier) type: (primitive_type)))
				(pattern (type_identifier) type: (primitive_type)))
			(primitive_type))))

=====
annotated expression in array size
=====

axm %test.blub.ding: <<a: b; Nat>>;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier)
			subtag: (value_identifier))
		type: (array_type
			size: (annotated value: (value_identifier) type: (value_identifier))
			type: (primitive_type))))

=====
mat map reduce
=====

axm %matrix.map_reduce:
    [
        n: Nat, S: «n; Nat», T: *,
        m: Nat,
        NI: «m; Nat»,
        TI: «m; *»,
        SI: «i:m; «NI#i; Nat»»
    ]
  → [
        mem:    %mem.M,
        zero:   T,
        comb:   Fn [%mem.M, T, «i: m; TI#i»] → [%mem.M, T],
        input:  «i: m; [«NI#i; Nat», %matrix.Mat (NI#i, SI#i, TI#i)]»
    ] → [%mem.M, %matrix.Mat (n, S, T)],
    normalize_map_reduce;

---

(source_file
	(axiom
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		type: (function_type
			(pattern
				(pattern (value_identifier) type: (primitive_type))
				(pattern (type_identifier) type: (array_type size: (value_identifier) type: (primitive_type)))
				(pattern (type_identifier) type: (primitive_type))
				(pattern (value_identifier) type: (primitive_type))
				(pattern (type_identifier)
					type: (array_type size: (value_identifier) type: (primitive_type)))
				(pattern (type_identifier)
					type: (array_type size: (value_identifier) type: (primitive_type)))
				(pattern (type_identifier)
					type: (array_type
						size: (annotated value: (value_identifier) type: (value_identifier))
						type: (array_type
							size: (extraction (type_identifier) (value_identifier))
							type: (primitive_type)))))
			(function_type
				(pattern
					(pattern (value_identifier) type: (annex
						module: (value_identifier)
						name: (type_identifier)))
					(pattern (value_identifier) type: (type_identifier))
					(pattern (value_identifier)
						type: (function_type
							(pattern type: (annex
								module: (value_identifier)
								name: (type_identifier)) type: (type_identifier)
								type: (array_type
									size: (annotated value: (value_identifier) type: (value_identifier))
									type: (extraction (type_identifier) (value_identifier))))
							(tuple (annex
								module: (value_identifier)
								name: (type_identifier)) (type_identifier))))
					(pattern (value_identifier)
						type: (array_type
							size: (annotated value: (value_identifier) type: (value_identifier))
							type: (tuple
								(array_type
									size: (extraction (type_identifier) (value_identifier))
									type: (primitive_type))
								(application
									(annex
										module: (value_identifier)
										name: (type_identifier))
									(tuple
										(extraction (type_identifier) (value_identifier))
										(extraction (type_identifier) (value_identifier))
										(extraction (type_identifier) (value_identifier))))))))
					(tuple
						(annex
							module: (value_identifier)
							name: (type_identifier))
						(application
							(annex
								module: (value_identifier)
								name: (type_identifier))
							(tuple
								(value_identifier)
								(type_identifier)
								(type_identifier))))))
		normalizer: (value_identifier)))

