=====
minus lam rhs
=====

lam %core.minus: Idx s = (0:(Idx s), a);

---

(source_file
	(lam
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		type: (primitive_type (value_identifier))
		value:
			(tuple
				(annotated
					value: (int_literal)
					type: (tuple (primitive_type (value_identifier))))
				(value_identifier))))

=====
lam paren
=====

lam %core.minus (s: Nat) (a: Idx s): Idx s = 0;

---

(source_file
	(lam
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		(pattern (pattern (value_identifier) type: (primitive_type)))
		(pattern (pattern (value_identifier) type: (primitive_type (value_identifier))))
		type: (primitive_type (value_identifier))
		value: (int_literal)))

=====
lam bracket
=====

lam %core.minus [s: Nat]: Idx s = 0;

---

(source_file
	(lam
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		(pattern (pattern (value_identifier) type: (primitive_type)))
		type: (primitive_type (value_identifier))
		value: (int_literal)))

=====
lam brace
=====

lam %core.minus {s: Nat} (a: Idx s): Idx s = 0;

---

(source_file
	(lam
		name: (annex
			module: (value_identifier)
			name: (value_identifier))
		(pattern (pattern (value_identifier) type: (primitive_type)))
		(pattern (pattern (value_identifier) type: (primitive_type (value_identifier))))
		type: (primitive_type (value_identifier))
		value: (int_literal)))

=====
1-tuple expression
=====

lam foo: Nat = (3);

---

(source_file
	(lam
		name: (value_identifier)
		type: (primitive_type)
		value: (tuple (int_literal))))
